zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Inc/py32f031_ll_comp.h
/** @defgroup COMP_LL_EC_COMMON_WINDOWMODE Comparator common modes - Window mode
  * @{
  */
#define LL_COMP_WINDOWMODE_DISABLE                 (0x00000000U)                                                    /*!< Window mode disable: Comparators 1 and 2 are independent */
#define LL_COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | LL_COMP_WINDOWMODE_COMP_EVEN_REGOFFSET_MASK)  /*!< Window mode enable: if used from COMP1 or COMP2 instance, comparators instances pair COMP1 and COMP2 have their input plus connected together, the common input is COMP1 input plus (COMP2 input plus is no more accessible). */
#define LL_COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | LL_COMP_WINDOWMODE_COMP_ODD_REGOFFSET_MASK)  /*!< Window mode enable: if used from COMP1 or COMP2 instance, comparators instances pair COMP1 and COMP2 have their input plus connected together, the common input is COMP2 input plus (COMP1 input plus is no more accessible). */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_PLUS Comparator inputs - Input plus (input non-inverting) selection
  * @{
  */
#define LL_COMP_INPUT_PLUS_IO0  (0x00000000U)                          /*!< Comparator input plus connected to IO0(pin PB8 for COMP1, pin PB6 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO1  (COMP_CSR_INPSEL_0)                     /*!< Comparator input plus connected to IO1(pin PB2 for COMP1, pin PB4 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO2  (COMP_CSR_INPSEL_1)                     /*!< Comparator input plus connected to IO2(pin PA1 for COMP1, pin PA5 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO3  (COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO3(OPA1_VOUT for COMP1, pin PA4 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO4  (COMP_CSR_INPSEL_2)                     /*!< Comparator input plus connected to IO4(Reserved for COMP1, pin PA3 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO5  (COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO5(Reserved for COMP1, pin PF3 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO6  (COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_1) /*!< Comparator input plus connected to IO6(Reserved for COMP1, OPA2_VOUT for COMP2) */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_MINUS Comparator inputs - Input minus (input inverting) selection
  * @{
  */
#define LL_COMP_INPUT_MINUS_IO0 (0x00000000U)                          /*!< Comparator input minus connected to IO0(pin PB1 for COMP1, pin PB7 for COMP2) */
#define LL_COMP_INPUT_MINUS_IO1 (COMP_CSR_INMSEL_0)                     /*!< Comparator input minus connected to IO1(Reserved for COMP1, pin PB3 for COMP2) */
#define LL_COMP_INPUT_MINUS_IO2 (COMP_CSR_INMSEL_1)                     /*!< Comparator input minus connected to IO2(pin PA0 for COMP1, pin PA2 for COMP2) */ 
#define LL_COMP_INPUT_MINUS_IO3 (COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to IO3(Reserved for COMP1, pin TS_VOUT for COMP2) */
#define LL_COMP_INPUT_MINUS_IO4 (COMP_CSR_INMSEL_2)                     /*!< Comparator input minus connected to IO4(TS_VOUT for COMP1, pin VREFCMP COMP2) */
#define LL_COMP_INPUT_MINUS_IO6 (COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1) /*!< Comparator input minus connected to IO6(VREFCMP for COMP1, Reserved COMP2) */
/**
  * @}
  */
  
/** @defgroup COMP_LL_EC_VREFCMP_DIV Comparator Vrefcmp Div
  * @{
  */
#define LL_COMP_VREFCMP_DIV_1_64VREFCMP     (0x00000000U)     
#define LL_COMP_VREFCMP_DIV_2_64VREFCMP     (                                                                                               COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_3_64VREFCMP     (                                                                            COMP_CSR_VCDIV_1                   )
#define LL_COMP_VREFCMP_DIV_4_64VREFCMP     (                                                                            COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_5_64VREFCMP     (                                                         COMP_CSR_VCDIV_2                                      ) 
#define LL_COMP_VREFCMP_DIV_6_64VREFCMP     (                                                         COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_7_64VREFCMP     (                                                         COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_8_64VREFCMP     (                                                         COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_9_64VREFCMP     (                                      COMP_CSR_VCDIV_3                                                         )
#define LL_COMP_VREFCMP_DIV_10_64VREFCMP    (                                      COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_11_64VREFCMP    (                                      COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   )  
#define LL_COMP_VREFCMP_DIV_12_64VREFCMP    (                                      COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_13_64VREFCMP    (                                      COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      ) 
#define LL_COMP_VREFCMP_DIV_14_64VREFCMP    (                                      COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_15_64VREFCMP    (                                      COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_16_64VREFCMP    (                                      COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)      
#define LL_COMP_VREFCMP_DIV_17_64VREFCMP    (                   COMP_CSR_VCDIV_4                                                                            ) 
#define LL_COMP_VREFCMP_DIV_18_64VREFCMP    (                   COMP_CSR_VCDIV_4                                                          | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_19_64VREFCMP    (                   COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_20_64VREFCMP    (                   COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_21_64VREFCMP    (                   COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                                      ) 
#define LL_COMP_VREFCMP_DIV_22_64VREFCMP    (                   COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_23_64VREFCMP    (                   COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define LL_COMP_VREFCMP_DIV_24_64VREFCMP    (                   COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_25_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                                         ) 
#define LL_COMP_VREFCMP_DIV_26_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_27_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_28_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_29_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      )  
#define LL_COMP_VREFCMP_DIV_30_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)   
#define LL_COMP_VREFCMP_DIV_31_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )      
#define LL_COMP_VREFCMP_DIV_32_64VREFCMP    (                   COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_33_64VREFCMP    (COMP_CSR_VCDIV_5                                                                                               ) 
#define LL_COMP_VREFCMP_DIV_34_64VREFCMP    (COMP_CSR_VCDIV_5                                                                             | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_35_64VREFCMP    (COMP_CSR_VCDIV_5                                                          | COMP_CSR_VCDIV_1                   )  
#define LL_COMP_VREFCMP_DIV_36_64VREFCMP    (COMP_CSR_VCDIV_5                                                          | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_37_64VREFCMP    (COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2                                      ) 
#define LL_COMP_VREFCMP_DIV_38_64VREFCMP    (COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_39_64VREFCMP    (COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_40_64VREFCMP    (COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_41_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                                                         )   
#define LL_COMP_VREFCMP_DIV_42_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_43_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_44_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_45_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      )  
#define LL_COMP_VREFCMP_DIV_46_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_47_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_48_64VREFCMP    (COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_49_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                                                            )   
#define LL_COMP_VREFCMP_DIV_50_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                                          | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_51_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1                   )     
#define LL_COMP_VREFCMP_DIV_52_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_53_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                                      )  
#define LL_COMP_VREFCMP_DIV_54_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_55_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_56_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_57_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                                         ) 
#define LL_COMP_VREFCMP_DIV_58_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_59_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   ) 
#define LL_COMP_VREFCMP_DIV_60_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)   
#define LL_COMP_VREFCMP_DIV_61_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      )     
#define LL_COMP_VREFCMP_DIV_62_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_63_64VREFCMP    (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )  
#define LL_COMP_VREFCMP_DIV_VREFCMP         (COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0) 
/**
  * @}
  */  
 
/** @defgroup COMP_LL_EC_VREFCMP_SOURCE Comparator Vrefcmp Source
  * @{
  */  
#define LL_COMP_VREFCMP_SOURCE_VCC          (COMP_CSR_VCSEL)
#define LL_COMP_VREFCMP_SOURCE_VREFBUF      (0x00000000U)
/**
  * @}
  */   

/** @defgroup COMP_LL_EC_OUTPUT_POLARITY Comparator output - Output polarity
  * @{
  */
#define LL_COMP_OUTPUTPOL_NONINVERTED       (0x00000000U)           /*!< COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input */
#define LL_COMP_OUTPUTPOL_INVERTED          (COMP_CSR_POLARITY)     /*!< COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_LEVEL Comparator output - Output level
  * @{
  */
#define LL_COMP_OUTPUT_LEVEL_LOW            (0x00000000U)          /*!< Comparator output level low (if the polarity is not inverted, otherwise to be complemented) */
#define LL_COMP_OUTPUT_LEVEL_HIGH           (0x00000001U)          /*!< Comparator output level high (if the polarity is not inverted, otherwise to be complemented) */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_HYSTERESIS Comparator Hysteresis
  * @{
  */
#define LL_COMP_HYSTERESIS_ENABLE           (COMP_CSR_HYST)        /*!< Comparator Hysteresis Enable */
#define LL_COMP_HYSTERESIS_DISABLE          (0x00000000U)          /*!< Comparator Hysteresis Disable */
/**
  * @}
  */

